OpenFOAM-4.x-master/tutorials/multiphase/interDyMFoam/ras/mixerVesselAMI/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`


./Allrun.pre

# Decompose
runApplication decomposePar -force

# Run
runParallel $application

# Reconstruct
runApplication reconstructPar -noFunctionObjects

#------------------------------------------------------------------------------
